#11.10.2026
user_name = input("Привет тебе, Странник, ка тебя зовут?")
print(f"Мне приятно знать твое имя {user_name}! Самое время отправляться в путешествие") 
one_artifact = False
two_artifact = False
three_artifact = False
points = 0
print ("""Тимур, ты начинаешь игру с 0 очков. В ходе игры ты будешь получать очки, за которые ты сможешь приобрести интересные вещи, но и артефакты, которые сможешь помогут тебе достичь победы.

За каждый правельный ответ ты будешь получать очки:
за правельный ответ на 1-ое задание: 10 очков
за правельный ответ на 2-ое задание: 20 очков
за правельнй ответ на 3-ье задание: 30 очков""" )
print("""Два медвеженка нашли головку сыра, они долго спорили, как ее поделить, но ни кто не хотел уступать. Мимо пробегала лиса, узнав о 
чем спор, предложила помочь, разломив головку сыра на 2 части так, чтобы одна из них была полкилограмма, а другая меньше. Затем 
она спросила, усмехаясь:
- Куски равны???
Жадные медвежата да ли отрицательный ответ. Тогда лиса откусила от большей части но так, чтобы от неё остался кусок меньше, чем другая часть, чем другая часть, и повторила вопрос
И на этот раз медвежата сообщили,
что получились неравные части. После этого лиса повторила откусывание еще 9 раз,
каждый раз откусывая одинаковое количество сыра. В результате остались маленькие
кусочки, причем один из них оказался на 20 граммов больше другого. Лиса заявила, что
медвежатам трудно угодить. Она отправила оба кусочка в рот и, вильнув хвостом,
скрылась в кустах. Какова была масса головки сыра в граммах?""")
answer_one = input("Введите ответ:")
if answer_one == "980":
    print("Не знаю, отгадал ты или действительно посчитал, но ты прав! твои очки 10 ")
    points += 10
    one_artifact = True
else:
    print("К сожелению не правельный ответ, твои очки: 0")
print("Задача 1. В ряду чисел 2, 4, 8, 16, … каждое следующее вдвое больше предыдущего. Какое число будет на седьмом месте?")
answer_two = input("Введите ответ")
if answer_two == "128":
    print(f"Не знаю, отгадал ты или действительно посчитал, но ты прав! Твои очки {points}")
    points += 20
    two_artifac = True
else: 
     print("К сожелению не правельный ответ")
print("На доске написаны числа от 1 до 100. Сколько раз встречается цифра 7?")
answer_three = input("Введите ответ")
if answer_three == "20":
    print(f"Не знаю, отгадал ты или действительно посчитал, но ты прав! {points}")
    points += 30
    three_artifact = True
else:
    print("К сожелению не правельный ответ.") 
print("""Ты завершил испытание, и теперь можешь последовать в магазин и выбрать себе что-нибудь одно
1. молодильное яблоко 13 points
2 волшебный клубок 27 points
3.мороженое 14 points
4.ковер самолет 30 points
5.пропустить""")    
product = input("Твой выбор:")
if product == "1":
    if points >= 13:
        print("Теперь у тебя есть молодильное яблоко!!!" )
        points -= 13
    else:
        print("К сожалению у вас не достаточно денег")
elif product == "2":
    if points >= 27:
        print("Теперь у тебя есть волшебный клубок!! ")
        points -= 27
    else:
        print("К сожалению у вас не достаточно денег")
elif product == "3":
    if points >=14:
        print("Теперь у вас есть мороженое")
        points -= "14"
    else:
        print("К сожалению у вас не достаточно денег")
elif product == "4":
    if points >= 30:
       print("Теперь у вас есть ковер самолет")
       points -= "30"
    else:
        print("К сожалению у вас не достаточно денег")
elif product == "5":
    print("Спасибо что посетили наш сайт")
if one_artifact == True and two_artifact == True and three_artifact == True:
    print(f"Поздравляю, вы добыли все 3 артефакта. Количество ваших очков после посещения магазина: {points}" )
elif one_artifact == True and two_artifact == True and three_artifact == False:
   print(f"К сожалению вы не добыли 3 артефакт. Количество ваших очков после посещения магазина: {points}" )
elif one_artifact == True and two_artifact == False and three_artifact == True:
    print(f"К сожалению вы не добыли 2 артефакт. Количество ваших очков после посещения магазина: {points}" )
elif one_artifact == False and two_artifact == True and  three_artifact == True:
    print(f"К сожалению вы не добыли 1 артефакт. Количество ваших очков после посещения магазина: {points}" )
elif one_artifact == True or two_artifact == True or three_artifact == True:
    print(f"К сожалению, ты нашёл только один артефакт. Количество ваших очков после посещения магазина: {points}")
else:
   print(f"К сожалению, ни один артефакт не собран. Количество ваших очков после посещения магазина: {points}")